CS132-F23/info.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-17 Sun 16:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Information</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="courseStyle.css">
</head>
<body>
<div id="org-div-home-and-up">⟨ <a href="index.html">home</a> ⟩</div><div id="content" class="content">
<h1 class="title">Information
<br />
<span class="subtitle">Geometric Algorithms<br> Boston University<br> Fall 2023</span>
</h1>
<p>
<b>CAS CS 132 (Geometric Algorithms)</b> is an introduction to <code>linear
algebra</code> with a bent towards applications in computer science. One of
its primary goals is to prepare students (you) for courses in the CS
cirriculum at BU which require some degree of linear algebra. Due to
the fundamentality of linear algebra, in machine learning, in graph
algorithms, in optimization, in graphics (and so on), this list of courses
is substantial.
</p>

<p>
I want to also make clear at the offset that this is <i>not</i> a course in
computational geometry in the traditional sense; we will not cover
some beautiful topics like triangulation, mesh generation, geometric
data structures, or convex programming (despite the seemingly
out-dated description of the course in our registrar).
</p>

<p>
Instead, we will be covering other beautiful topics like matrix
factorization, eigenvectors, Markov chains (and so on again). The
"geometric" part comes from the way we will learn to <i>think</i>
geometrically, in how linear algebra will help us conceptualize data
as something spatial. Professor Mark Crovella has a nice note on this
in the <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/landing-page.html">preface of the text</a> we will be using for this course.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
⟪ <i><b>Prerequisites</b></i> ⟫ CAS CS 111 (in particular, knowledge of python)
</p>

<div id="outline-container-org2352de1" class="outline-2">
<h2 id="org2352de1">Resources</h2>
<div class="outline-text-2" id="text-org2352de1">
<p>
⟪ <i><b>Material</b></i> ⟫ We will primarily be using the <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/landing-page.html">online text</a> written by
Professor Mark Crovella for this coures. The text is a jupyter
notebook which you can <a href="https://github.com/mcrovella/CS132-Geometric-Algorithms">access online</a>. All supplementary material will
be made available on this site and on Piazza.
</p>

<p>
Much of the matrial in this online text is based on the textbook
<b>Linear Algebra and its Applications</b> by David Lay, Steven Lay and
Judi McDonald. When possible I will include optional readings of the
associated sections. This is also a great resource for practice
problems. I will also occasionally refer to <a href="https://textbooks.math.gatech.edu/ila/index.html">Interactive Linear
Algebra</a>, a beautiful textbook out of Georgia Tech by Dan Margalit
and Joseph Rabinoff.
</p>

<p>
⟪ <i><b>Programming</b></i> ⟫ The programming assignments for this course (and the
examples in the text) are written in <code>python</code> with the libraries, numpy,
scipy, and matplotlib. It is required that you set this up on you
personal machine or on a machine that you will have access to over the
semester. Please attend office hours and use Piazza if you need help
troubleshooting. If you are worried about access to technology, please
contact me <i>as soon as possible</i> and we can see what we can do (though
I cannot make any guarantees).
</p>

<p>
⟪ <i><b>Course Communication</b></i> ⟫ Course announcements and discussions will
happen on <code>Piazza</code>. If you are unfamiliar with Piazza, see their
<a href="https://support.piazza.com/support/solutions/48000185443">support page</a> for information and tutorials. Some policies regarding
the use of Piazza:
</p>

<ul class="org-ul">
<li><code>Don't ask homework questions directly.</code> Formulate a question which
will aid in your understanding, and will hopefully help others as
well.</li>
<li><code>Don't give homework solutions directly.</code> The answer-provider is
just as culpable as the answer-receiver in cases of cheating.</li>
<li>Piazza is as useful as it is active. Teaching fellows and course
assistants will be answering questions on Piazza, but don't hesitate
to answer questions yourself.</li>
</ul>

<p>
⟪ <i><b>Homework Submission</b></i> ⟫ Assignments are submitted on <code>Gradescope</code>. If
you are unfamiliar with Gradescope, see their <a href="https://www.gradescope.com/get_started">get-started page</a> for
information and tutorials.
</p>

<p>
⟪ <i><b>Office Hours</b></i> ⟫ Please see Piazza for posted offices hours.
</p>
</div>
</div>

<div id="outline-container-org7d5f672" class="outline-2">
<h2 id="org7d5f672">Evaluation</h2>
<div class="outline-text-2" id="text-org7d5f672">
<p>
⟪ <i><b>Homework</b></i> ⟫ Problem sets are <code>assigned each Thursday</code> and are <code>due the
following Thursday</code> by <code>2PM</code>. You can discuss assignments during
sections on Mondays, but TFs not go into details of the problems.
</p>

<p>
Each assignment will consist of two parts, one part <i>analytical</i>
(calculations/proofs) and one part <i>computational</i> (python code).
</p>

<p>
For the analytic portion, you will <code>submit a PDF via Gradescope</code>. Your
submissions may be scans of handwritten notes or PDFs created using
Word, markdown, LaTeX, etcetera (this is the preferred choice, and I
highly recommend learning LaTeX, especially if you're interested in
doing research). Handwritten submissions MUST be neat and the
graders have license to dock points if your submission is not legible.
For the computational portion, you will <code>submit code via Gradescope</code>.
</p>

<p>
There are <code>12 problem sets</code> in total (the last one is shorter but
worth the same amount) and your <code>10 highest scores</code> will contribute to
your final grade.
</p>

<p>
<code>Late assignments will not be accepted.</code> This allows us to post
solutions in a timely manner.
</p>

<p>
Expect to commit some time each week to these assignments.
</p>

<p>
⟪ <i><b>Exams</b></i> ⟫ There will be <code>one midterm</code> and a <code>cumulative final</code>.
</p>

<p>
⟪ <i><b>Participation</b></i> ⟫ Part of your grade will be determined by your
participation in a weekly Google form.
</p>

<p>
⟪ <i><b>Grading</b></i> ⟫ Your final grade will be determined by
</p>

<ul class="org-ul">
<li><b>50%</b> homework (top 10 of 12 scores)</li>
<li><b>20%</b> midterm exam</li>
<li><b>30%</b> final exam</li>
<li><b>05%</b> participation</li>
</ul>

<p>
Cut-offs for letter grades will be determined at the end of the
course. I cannot guarantee what the cut-off will be, but you will not
receive a letter grade lower than the one determined by your <a href="https://www.bu.edu/academics/wheelock/policies/grades-course-credits-incomplete-coursework/">raw
percentage</a>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">This
page is based on a syllabus provided to me by Mark Crovella.</p></div></div>


</div>
</div></div>
</body>
</html>